/*
SQLyog Enterprise - MySQL GUI v6.5 Beta1
MySQL - 5.1.39-community : Database - worldcup2006
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

create database if not exists `worldcup2006`;

USE `worldcup2006`;

/*Table structure for table `matchrecord` */

DROP TABLE IF EXISTS `matchrecord`;

CREATE TABLE `matchrecord` (
  `xgroup` char(1) NOT NULL,
  `teamname1` char(20) NOT NULL,
  `teamname2` char(20) NOT NULL,
  `number` int(11) DEFAULT NULL,
  `fixture` datetime DEFAULT NULL,
  `goalsfor1` int(11) DEFAULT NULL,
  `goalsfor2` int(11) DEFAULT NULL,
  PRIMARY KEY (`teamname1`,`teamname2`),
  KEY `teamname2` (`teamname2`),
  CONSTRAINT `matchrecord_ibfk_1` FOREIGN KEY (`teamname1`) REFERENCES `teamscore` (`teamname`),
  CONSTRAINT `matchrecord_ibfk_2` FOREIGN KEY (`teamname2`) REFERENCES `teamscore` (`teamname`)
) ENGINE=InnoDB DEFAULT CHARSET=gbk;

/*Data for the table `matchrecord` */

insert  into `matchrecord`(`xgroup`,`teamname1`,`teamname2`,`number`,`fixture`,`goalsfor1`,`goalsfor2`) values ('C','阿根廷','科特迪瓦',5,'2006-06-11 03:00:00',2,1),('C','阿根廷','塞黑',21,'2006-06-16 21:00:00',6,0),('D','安哥拉','葡萄牙',8,'2006-06-12 03:00:00',0,1),('F','澳大利亚','日本',12,'2006-06-12 21:00:00',3,1),('B','巴拉圭','特立尼达和多巴哥',36,'2006-06-21 03:00:00',2,0),('F','巴西','澳大利亚',27,'2006-06-19 00:00:00',2,0),('F','巴西','克罗地亚',11,'2006-06-14 03:00:00',1,0),('A','波兰','厄瓜多尔',2,'2006-06-10 03:00:00',0,2),('A','德国','波兰',17,'2006-06-15 03:00:00',1,0),('A','德国','哥斯达黎加',1,'2006-06-10 00:00:00',4,2),('G','多哥','法国',45,'2006-06-24 03:00:00',0,2),('G','多哥','瑞士',30,'2006-06-19 21:00:00',0,2),('A','厄瓜多尔','德国',33,'2006-06-20 22:00:00',0,3),('A','厄瓜多尔','哥斯达黎加',18,'2006-06-15 21:00:00',3,0),('G','法国','韩国',29,'2006-06-19 03:00:00',1,1),('G','法国','瑞士',13,'2006-06-14 00:00:00',0,0),('A','哥斯达黎加','波兰',34,'2006-06-20 22:00:00',1,2),('G','韩国','多哥',14,'2006-06-13 21:00:00',2,1),('C','荷兰','阿根廷',37,'2006-06-22 03:00:00',0,0),('C','荷兰','科特迪瓦',22,'2006-06-17 00:00:00',2,1),('E','加纳','美国',42,'2006-06-22 22:00:00',2,1),('E','捷克','加纳',26,'2006-06-18 00:00:00',0,2),('E','捷克','意大利',41,'2006-06-22 22:00:00',0,2),('C','科特迪瓦','塞黑',38,'2006-06-22 03:00:00',3,2),('F','克罗地亚','澳大利亚',44,'2006-06-23 03:00:00',2,2),('E','美国','捷克',10,'2006-06-13 00:00:00',0,3),('D','墨西哥','安哥拉',23,'2006-06-17 03:00:00',0,0),('D','墨西哥','伊朗',7,'2006-06-12 00:00:00',3,1),('D','葡萄牙','墨西哥',39,'2006-06-21 22:00:00',2,1),('D','葡萄牙','伊朗',24,'2006-06-17 21:00:00',2,0),('F','日本','巴西',43,'2006-06-23 03:00:00',1,4),('F','日本','克罗地亚',28,'2006-06-18 21:00:00',0,0),('B','瑞典','巴拉圭',20,'2006-06-16 03:00:00',1,0),('B','瑞典','英格兰',35,'2006-06-21 03:00:00',2,2),('G','瑞士','韩国',46,'2006-06-24 03:00:00',2,0),('C','塞黑','荷兰',6,'2006-06-11 21:00:00',0,1),('H','沙特','乌克兰',32,'2006-06-20 00:00:00',0,4),('H','沙特','西班牙',47,'2006-06-23 22:00:00',0,1),('B','特立尼达和多巴哥','瑞典',4,'2006-06-11 00:00:00',0,0),('H','突尼斯','沙特',16,'2006-06-15 00:00:00',2,2),('H','乌克兰','突尼斯',48,'2006-06-23 22:00:00',1,0),('H','西班牙','突尼斯',31,'2006-06-20 03:00:00',3,1),('H','西班牙','乌克兰',15,'2006-06-14 21:00:00',4,0),('D','伊朗','安哥拉',40,'2006-06-21 22:00:00',1,1),('E','意大利','加纳',9,'2006-06-13 03:00:00',2,0),('E','意大利','美国',25,'2006-06-18 03:00:00',1,1),('B','英格兰','巴拉圭',3,'2006-06-10 21:00:00',1,0),('B','英格兰','特立尼达和多巴哥',19,'2006-06-16 00:00:00',2,0);

/*Table structure for table `teamscore` */

DROP TABLE IF EXISTS `teamscore`;

CREATE TABLE `teamscore` (
  `xgroup` char(1) NOT NULL,
  `teamname` char(20) NOT NULL,
  `completed` int(11) DEFAULT '0',
  `win` int(11) DEFAULT '0',
  `tie` int(11) DEFAULT '0',
  `loss` int(11) DEFAULT '0',
  `goalsfor` int(11) DEFAULT '0',
  `goalsagaint` int(11) DEFAULT '0',
  `netvalue` int(11) DEFAULT '0',
  `score` int(11) DEFAULT '0',
  `rank` int(11) DEFAULT '0',
  PRIMARY KEY (`teamname`)
) ENGINE=InnoDB DEFAULT CHARSET=gbk;

/*Data for the table `teamscore` */

insert  into `teamscore`(`xgroup`,`teamname`,`completed`,`win`,`tie`,`loss`,`goalsfor`,`goalsagaint`,`netvalue`,`score`,`rank`) values ('C','阿根廷',3,2,1,0,8,1,7,7,1),('D','安哥拉',3,0,2,1,1,2,-1,2,3),('F','澳大利亚',3,1,1,1,5,5,0,4,2),('B','巴拉圭',3,1,0,2,2,2,0,3,3),('F','巴西',3,3,0,0,7,1,6,9,1),('A','波兰',3,1,0,2,2,4,-2,3,3),('A','德国',3,3,0,0,8,2,6,9,1),('G','多哥',3,0,0,3,1,6,-5,0,4),('A','厄瓜多尔',3,2,0,1,5,3,2,6,2),('G','法国',3,1,2,0,3,1,2,5,2),('A','哥斯达黎加',3,0,0,3,3,9,-6,0,4),('G','韩国',3,1,1,1,3,4,-1,4,3),('C','荷兰',3,2,1,0,3,1,2,7,2),('E','加纳',3,2,0,1,4,3,1,6,2),('E','捷克',3,1,0,2,3,4,-1,3,3),('C','科特迪瓦',3,1,0,2,5,6,-1,3,3),('F','克罗地亚',3,0,2,1,2,3,-1,2,3),('E','美国',3,0,1,2,2,6,-4,1,4),('D','墨西哥',3,1,1,1,4,3,1,4,2),('D','葡萄牙',3,3,0,0,5,1,4,9,1),('F','日本',3,0,1,2,2,7,-5,1,4),('B','瑞典',3,1,2,0,3,2,1,5,2),('G','瑞士',3,2,1,0,4,0,4,7,1),('C','塞黑',3,0,0,3,2,10,-8,0,4),('H','沙特',3,0,1,2,2,7,-5,1,4),('B','特立尼达和多巴哥',3,0,1,2,0,4,-4,1,4),('H','突尼斯',3,0,1,2,3,6,-3,1,3),('H','乌克兰',3,2,0,1,5,4,1,6,2),('H','西班牙',3,3,0,0,8,1,7,9,1),('D','伊朗',3,0,1,2,2,6,-4,1,4),('E','意大利',3,2,1,0,5,1,4,7,1),('B','英格兰',3,2,1,0,5,2,3,7,1);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
