/*比赛记录（组别，球队1，球队2，场次，比赛时间，队1进球数，队2进球数）
CREATE TABLE MatchRecord 
(             
     number int(11) DEFAULT NULL,         
     fixture datetime DEFAULT NULL,       
     xgroup char(1) NOT NULL,             
     teamname1 char(20) NOT NULL,         
     teamname2 char(20) NOT NULL,         
     goalsfor1 int(11) DEFAULT NULL,      
     goalsfor2 int(11) DEFAULT NULL,      
   PRIMARY KEY (teamname1,teamname2),
   FOREIGN KEY(teamname1) REFERENCES TeamScore(teamname),
   FOREIGN KEY(teamname2) REFERENCES TeamScore(teamname)
);*/

INSERT INTO MatchRecord
  VALUES (1, '2006-6-10 0:0',  'A', '德国','哥斯达黎加', 4, 2),
         (2, '2006-6-10 3:00', 'A', '波兰', '厄瓜多尔',  0, 2),
         (3, '2006-6-10 21:00','B', '英格兰','巴拉圭',  1, 0),
         (4, '2006-6-11 0:00', 'B', '特立尼达和多巴哥','瑞典',  0, 0),
         (5, '2006-6-11 3:00', 'C', '阿根廷','科特迪瓦',  2, 1),
         (6, '2006-6-11 21:00','C', '塞黑','荷兰',  0, 1),
         (7, '2006-6-12 0:00', 'D', '墨西哥','伊朗',  3, 1),
         (8, '2006-6-12 3:00', 'D', '安哥拉','葡萄牙',  0, 1),
         (9, '2006-6-13 3:00', 'E', '意大利','加纳',  2, 0),
         (10,'2006-6-13 0:00', 'E', '美国','捷克',  0, 3),
         (11,'2006-6-14 3:00', 'F', '巴西','克罗地亚',  1, 0),
         (12,'2006-6-12 21:00','F', '澳大利亚','日本',  3, 1),
         (13,'2006-6-14 0:00', 'G', '法国','瑞士',  0, 0),
         (14,'2006-6-13 21:00','G', '韩国','多哥',  2, 1),
         (15,'2006-6-14 21:00','H', '西班牙','乌克兰',  4, 0),
         (16,'2006-6-15 0:00', 'H', '突尼斯','沙特',  2, 2),
         (17,'2006-6-15 3:0',  'A', '德国','波兰', 1, 0),
         (18,'2006-6-15 21:00','A', '厄瓜多尔', '哥斯达黎加',  3, 0),
         (19,'2006-6-16 0:00', 'B', '英格兰','特立尼达和多巴哥',  2, 0),
         (20,'2006-6-16 3:00', 'B', '瑞典','巴拉圭',  1, 0),
         (21,'2006-6-16 21:00','C', '阿根廷','塞黑',  6, 0),
         (22,'2006-6-17 0:00', 'C', '荷兰','科特迪瓦',  2, 1),
         (23,'2006-6-17 3:00', 'D', '墨西哥','安哥拉',  0, 0),
         (24,'2006-6-17 21:00','D', '葡萄牙','伊朗',  2, 0),
         (25,'2006-6-18 3:00', 'E', '意大利','美国',  1, 1),
         (26,'2006-6-18 0:00', 'E', '捷克','加纳',  0, 2),
         (27,'2006-6-19 0:00', 'F', '巴西','澳大利亚',  2, 0),
         (28,'2006-6-18 21:00','F', '日本','克罗地亚',  0, 0),
         (29,'2006-6-19 3:00', 'G', '法国','韩国',  1, 1),
         (30,'2006-6-19 21:00','G', '多哥','瑞士',  0, 2),
         (31,'2006-6-20 3:00', 'H', '西班牙','突尼斯',  3, 1),
         (32,'2006-6-20 0:00', 'H', '沙特','乌克兰',  0, 4),
         (33,'2006-6-20 22:0', 'A', '厄瓜多尔','德国', 0, 3),
         (34,'2006-6-20 22:00','A', '哥斯达黎加', '波兰',  1, 2),
         (35,'2006-6-21 3:00', 'B', '瑞典','英格兰',  2, 2),
         (36,'2006-6-21 3:00', 'B', '巴拉圭','特立尼达和多巴哥',  2, 0),
         (37,'2006-6-22 3:00', 'C', '荷兰','阿根廷',  0, 0),
         (38,'2006-6-22 3:00', 'C', '科特迪瓦','塞黑',  3, 2),
         (39,'2006-6-21 22:00','D', '葡萄牙','墨西哥',  2, 1),
         (40,'2006-6-21 22:00','D', '伊朗','安哥拉', 1, 1),
         (41,'2006-6-22 22:00','E', '捷克','意大利',  0, 2),
         (42,'2006-6-22 22:00','E', '加纳','美国',  2, 1),
         (43,'2006-6-23 3:00', 'F', '日本','巴西', 1, 4),
         (44,'2006-6-23 3:00', 'F', '克罗地亚','澳大利亚', 2, 2),
         (45,'2006-6-24 3:00', 'G', '多哥','法国', 0, 2),
         (46,'2006-6-24 3:00', 'G', '瑞士','韩国', 2, 0),
         (47,'2006-6-23 22:00','H', '沙特','西班牙',  0, 1),
         (48,'2006-6-23 22:00','H', '乌克兰','突尼斯',  1, 0);

/*
DELETE FROM MatchRecord
/*
SELECT * FROM MatchRecord ORDER BY xgroup,number

/*
SELECT *
  FROM MatchRecord
 WHERE xgroup='A'
 ORDER BY number

UPDATE MatchRecord
 set number=0,
     goalsfor1=0,
     goalsfor2=0

*/