/*《Java程序设计实用教程（第5版）》 作者：叶核亚，2018年8月26日
  §12.4 数据库应用
  【例12.7】 世界杯足球赛成绩统计。
  （2）比赛记录表
*/

use worldcup2018;


/*比赛记录（场次，比赛时间，组别，球队1，球队2，队1进球数，队2进球数，比赛地点）
CREATE TABLE MatchRecord 
(             
     number int(4) DEFAULT 0,         
     fixture datetime DEFAULT NULL,       
     xgroup char(1) NOT NULL,             
     teamname1 char(20) NOT NULL,         
     teamname2 char(20) NOT NULL,         
     goalsfor1 int(4) DEFAULT NULL,      
     goalsfor2 int(4) DEFAULT NULL,
	 venue char(20) DEFAULT NULL,  
   PRIMARY KEY (teamname1,teamname2),
   FOREIGN KEY(teamname1) REFERENCES TeamScore(teamname),
   FOREIGN KEY(teamname2) REFERENCES TeamScore(teamname)
) ENGINE=InnoDB DEFAULT CHARSET=gbk;


/*比赛记录表，小组赛
INSERT INTO MatchRecord
  VALUES (1, '2018-06-14 23:00', 'A', '俄罗斯', '沙特', 5, 0, '莫斯科，卢日尼基体育场'),
          (2, '2018-06-15 20:00', 'A', '埃及', '乌拉圭', 0, 1, '叶卡捷琳堡，中央体育场'),
          (3, '2018-06-16 02:00', 'B', '葡萄牙', '西班牙', 3, 3, '索契，菲什特奥林匹克体育场'),
          (4, '2018-06-15 23:00', 'B', '摩洛哥', '伊朗', 0, 1, '圣彼得堡，新泽尼特体育场'),
          (5, '2018-06-16 18:00', 'C', '法国', '澳大利亚', 2, 1, '喀山，喀山体育场'),
          (6, '2018-06-17 00:00', 'C', '秘鲁', '丹麦', 0, 1, '萨兰斯克，莫尔多瓦竞技场'),
          (7, '2018-06-16 21:00', 'D', '阿根廷', '冰岛', 1, 1, '莫斯科，斯巴达克体育场'),
          (8, '2018-06-17 03:00', 'D', '克罗地亚', '尼日利亚', 2, 0, '加里宁格勒，加里宁格勒体育场'),
          (9, '2018-06-18 02:00', 'E', '巴西', '瑞士', 1, 1, '顿河畔罗斯托夫，顿河畔罗斯托夫体育场'),
          (10, '2018-06-17 20:00', 'E', '哥斯达黎加', '塞尔维亚', 0, 1, '萨马拉，萨马拉体育场'),
          (11, '2018-06-17 23:00', 'F', '德国', '墨西哥', 0, 1, '莫斯科，卢日尼基体育场'),
          (12, '2018-06-18 20:00', 'F', '瑞典', '韩国', 1, 0, '下诺夫哥罗德，下诺夫哥罗德体育场'),
          (13, '2018-06-18 23:00', 'G', '比利时', '巴拿马', 3, 0, '索契，菲什特奥林匹克体育场'),
          (14, '2018-06-19 02:00', 'G', '突尼斯', '英格兰', 1, 2, '伏尔加格勒，伏尔加格勒体育场'),
          (15, '2018-06-19 23:00', 'H', '波兰', '塞内加尔', 1, 2, '莫斯科，斯巴达克体育场'),
          (16, '2018-06-19 20:00', 'H', '哥伦比亚', '日本', 1, 2, '萨兰斯克，莫尔多瓦竞技场'),
          (17, '2018-06-20 02:00', 'A', '俄罗斯', '埃及', 3, 1, '圣彼得堡，新泽尼特体育场'),
          (18, '2018-06-20 23:00', 'A', '乌拉圭', '沙特', 1, 0, '顿河畔罗斯托夫，顿河畔罗斯托夫体育场'),
          (19, '2018-06-20 20:00', 'B', '葡萄牙', '摩洛哥', 1, 0, '莫斯科，卢日尼基体育场'),
          (20, '2018-06-21 02:00', 'B', '伊朗', '西班牙', 0, 1, '喀山，喀山体育场'),
          (21, '2018-06-21 23:00', 'C', '法国', '秘鲁', 1, 0, '叶卡捷琳堡，中央体育场'),
          (22, '2018-06-21 20:00', 'C', '丹麦', '澳大利亚', 1, 1, '萨马拉，萨马拉体育场'),
          (23, '2018-06-22 02:00', 'D', '阿根廷', '克罗地亚', 0, 3, '下诺夫哥罗德，下诺夫哥罗德体育场'),
          (24, '2018-06-22 23:00', 'D', '尼日利亚', '冰岛', 2, 0, '伏尔加格勒，伏尔加格勒体育场'),
          (25, '2018-06-22 20:00', 'E', '巴西', '哥斯达黎加', 2, 0, '圣彼得堡，圣彼得堡体育场'),
          (26, '2018-06-23 02:00', 'E', '塞尔维亚', '瑞士', 1, 2, '加里宁格勒，加里宁格勒体育场'),
          (27, '2018-06-24 02:00', 'F', '德国', '瑞典', 2, 1, '索契，菲什特奥林匹克体育场'),
          (28, '2018-06-23 23:00', 'F', '韩国', '墨西哥', 1, 2, '顿河畔罗斯托夫，顿河畔罗斯托夫体育场'),
          (29, '2018-06-23 20:00', 'G', '比利时', '突尼斯', 5, 2, '莫斯科，斯巴达克体育场'),
          (30, '2018-06-24 20:00', 'G', '英格兰', '巴拿马', 6, 1, '下诺夫哥罗德，下诺夫哥罗德体育场'),
          (31, '2018-06-25 02:00', 'H', '波兰', '哥伦比亚', 0, 3, '喀山，喀山体育场'),
          (32, '2018-06-24 23:00', 'H', '日本', '塞内加尔', 2, 2, '叶卡捷琳堡，中央体育场'),
          (33, '2018-06-25 22:00', 'A', '乌拉圭', '俄罗斯', 3, 0, '萨马拉，萨马拉体育场'),
          (34, '2018-06-25 22:00', 'A', '沙特', '埃及', 2, 1, '伏尔加格勒，伏尔加格勒体育场'),
          (35, '2018-06-26 02:00', 'B', '伊朗', '葡萄牙', 1, 1, '萨兰斯克，莫尔多瓦竞技场'),
          (36, '2018-06-26 02:00', 'B', '西班牙', '摩洛哥', 2, 2, '加里宁格勒，加里宁格勒体育场'),
          (37, '2018-06-26 22:00', 'C', '丹麦', '法国', 0, 0, '莫斯科，卢日尼基体育场'),
          (38, '2018-06-26 22:00', 'C', '澳大利亚', '秘鲁', 0, 2, '索契，菲什特奥林匹克体育场'),
          (39, '2018-06-27 02:00', 'D', '尼日利亚', '阿根廷', 1, 2, '圣彼得堡，新泽尼特体育场'),
          (40, '2018-06-27 02:00', 'D', '冰岛', '克罗地亚', 1, 2, '顿河畔罗斯托夫，顿河畔罗斯托夫体育场'),
          (41, '2018-06-28 02:00', 'E', '塞尔维亚', '巴西', 0, 2, '莫斯科斯巴达克体育场'),
          (42, '2018-06-28 02:00', 'E', '瑞士', '哥斯达黎加', 2, 2, '下诺夫哥罗德下诺夫哥罗德体育场'),
          (43, '2018-06-27 22:00', 'F', '韩国', '德国', 2, 0, '喀山，喀山体育场'),
          (44, '2018-06-27 22:00', 'F', '墨西哥', '瑞典', 0, 3, '叶卡捷琳堡，中央体育场'),
          (45, '2018-06-29 02:00', 'G', '英格兰', '比利时', 0, 1, '加里宁格勒，加里宁格勒体育场'),
          (46, '2018-06-29 02:00', 'G', '巴拿马', '突尼斯', 1, 2, '萨兰斯克，莫尔多瓦竞技场'),
          (47, '2018-06-28 22:00', 'H', '日本', '波兰', 0, 1, '伏尔加格勒，伏尔加格勒体育场'),
          (48, '2018-06-28 22:00', 'H', '塞内加尔', '哥伦比亚', 0, 1, '萨马拉，萨马拉体育场');
          
          
/*比赛记录表，淘汰赛*
INSERT INTO MatchRecord
  VALUES (49, '2018-07-1 02:00', ' ', '乌拉圭', '葡萄牙', 2, 1, '索契，菲什特奥林匹克体育场'),
          (50, '2018-06-30 22:00', ' ', '法国', '阿根廷', 4, 3, '喀山，喀山体育场'),
          (51, '2018-07-1 22:00', ' ', '西班牙', '俄罗斯', 4, 5, '莫斯科，卢日尼基体育场'),
          (52, '2018-07-2 02:00', ' ', '克罗地亚', '丹麦', 4, 3, '下诺夫哥罗德，下诺夫哥罗德体育场'),
          (53, '2018-07-2 22:00', ' ', '巴西', '墨西哥', 2, 0, '萨马拉，萨马拉体育场'),
          (54, '2018-07-3 02:00', ' ', '比利时', '日本', 3, 2, '顿河畔罗斯托夫，顿河畔罗斯托夫体育场'),
          (55, '2018-07-3 22:00', ' ', '瑞典', '瑞士', 1, 0, '圣彼得堡，圣彼得堡体育场'),
          (56, '2018-07-4 02:00', ' ', '哥伦比亚', '英格兰', 4, 5, '莫斯科，斯巴达克体育场'),
          (57, '2018-07-6 22:00', ' ', '乌拉圭', '法国', 0, 2, '下诺夫哥罗德，下诺夫哥罗德体育场'),
          (58, '2018-07-7 02:00', ' ', '巴西', '比利时', 1, 2, '喀山，喀山体育场'),
          (60, '2018-07-7 22:00', ' ', '瑞典', '英格兰', 0, 2, '萨马拉，萨马拉体育场'),
          (59, '2018-07-8 02:00', ' ', '俄罗斯', '克罗地亚', 5, 6, '索契，菲什特奥林匹克体育场'),
          (61, '2018-07-11 02:00', ' ', '法国', '比利时', 1, 0, '圣彼得堡，圣彼得堡体育场'),
          (62, '2018-07-12 02:00', ' ', '克罗地亚', '英格兰', 2, 1, '莫斯科，卢日尼基体育场'),
          (63, '2018-07-14 22:00', ' ', '比利时', '英格兰', 2, 0, '圣彼得堡，圣彼得堡体育场'),
          (64, '2018-07-15 23:00', ' ', '法国', '克罗地亚', 4, 2, '莫斯科，卢日尼基体育场');

/* 以下可行
DROP TABLE matchrecord;

UPDATE matchrecord
  SET number=1,  fixture='2018-06-14 23:00', goalsfor1=5, goalsfor2=0, venue='莫斯科，卢日尼基体育场'
  WHERE xgroup='A' and teamname1='俄罗斯' and teamname2='沙特';

UPDATE matchrecord
  SET number=2,  fixture='2018-06-15 20:00', goalsfor1=0, goalsfor2=1, venue='叶卡捷琳堡，中央体育场'
  WHERE xgroup='A' and teamname1='埃及' and teamname2='乌拉圭';

UPDATE matchrecord
  SET number=17,  fixture='2018-06-20 02:00', goalsfor1=1, goalsfor2=3, venue='圣彼得堡，新泽尼特体育场'
  WHERE teamname1='埃及' and teamname2='俄罗斯'; 

/*
  DELETE FROM `worldcup2018`.`matchrecord` WHERE `teamname1`='俄罗斯' and`teamname2`='沙特';

  DELETE FROM matchrecord WHERE teamname1='埃及' and teamname2='乌拉圭';

/*以下不行，批量删除，不安全

DELETE FROM matchrecord; 

DELETE FROM matchrecord WHERE number='0';
*/

/*@author：Yeheya，2018年8月28日，2018年9月9日*/