/*比赛记录（组别，球队1，球队2，场次，比赛时间，地点，队1进球数，队2进球数）

CREATE TABLE MatchRecord 
(             
     number int(11) DEFAULT NULL,         
     fixture datetime DEFAULT NULL,       
     place   char(20) DEFAULT NULL,
     xgroup char(1) NOT NULL,             
     teamname1 char(20) NOT NULL,         
     teamname2 char(20) NOT NULL,         
     goalsfor1 int(11) DEFAULT NULL,      
     goalsfor2 int(11) DEFAULT NULL,      
   PRIMARY KEY (teamname1,teamname2),
   FOREIGN KEY(teamname1) REFERENCES TeamScore(teamname),
   FOREIGN KEY(teamname2) REFERENCES TeamScore(teamname)
);

INSERT INTO MatchRecord
  VALUES (1, '2002/5/31 19:30','韩国汉城',  'A', '法国','塞内加尔',0,1),
         (2, '2002/6/1 14:30', '日本新泻',  'E', '爱尔兰','喀麦隆',1,1),
         (3, '2002/6/1 17:00', '韩国蔚山',  'A', '乌拉圭','丹麦',1,2),
         (4, '2002/6/1 19:30', '日本札幌',  'E', '德国','沙特',8,0),
         (5, '2002/6/2 13:30', '日本鹿岛',  'F', '阿根廷','尼日利亚',1,0),
         (6, '2002/6/2 15:30', '韩国釜山',  'B', '巴拉圭','南非',2,2),
         (7, '2002/6/2 17:30', '日本琦玉',  'F', '英格兰','瑞典',1,1),
         (8, '2002/6/2 19:30', '韩国光州',  'B', '西班牙','斯洛文尼亚',3,1),
         (9, '2002/6/3 14:30', '日本新泻',  'G', '克罗地亚','墨西哥',0,1),
         (10,'2002/6/3 17:00', '韩国蔚山',  'C', '巴西','土耳其',2,1),
         (11,'2002/6/3 19:30', '日本札幌',  'G', '意大利','厄瓜多尔',2,0),
         (12,'2002/6/4 14:30', '韩国光州',  'C', '中国','哥斯达黎加',0,2),
         (13,'2002/6/4 17:00', '日本琦玉',  'H', '日本','比利时',2,2),
         (14,'2002/6/4 19:30', '韩国釜山',  'D', '韩国','波兰',2,0),
         (15,'2002/6/5 14:30', '日本神户',  'H', '俄罗斯','突尼斯',2,0),
         (16,'2002/6/5 17:00', '韩国水原',  'D', '美国','葡萄牙',3,2),
         (17,'2002/6/5 19:30', '日本鹿岛',  'E', '德国','爱尔兰',1,1),
         (18,'2002/6/6 14:30', '韩国大田',  'A', '丹麦','塞内加尔',1,1),
         (19,'2002/6/6 17:00', '日本琦玉',  'E', '喀麦隆','沙特',1,0),
         (20,'2002/6/6 17:30', '韩国釜山',  'A', '法国','乌拉圭',0,0),
         (21,'2002/6/7 14:30', '日本神户',  'F', '瑞典','尼日利亚',2,1),
         (22,'2002/6/7 17:00', '韩国全州',  'B', '西班牙','巴拉圭',3,1),
         (23,'2002/6/7 19:30', '日本札幌',  'F', '阿根廷','英格兰',0,1),
         (24,'2002/6/8 14:30', '韩国大邱',  'B', '南非','斯洛文尼亚',1,0),
         (25,'2002/6/8 17:00', '日本鹿岛',  'G', '意大利','克罗地亚',1,2),
         (26,'2002/6/8 19:30', '韩国西归埔','C', '巴西','中国',4,0),
         (27,'2002/6/9 14:30', '日本仙台',  'G', '墨西哥','厄瓜多尔',2,1),
         (28,'2002/6/9 17:00', '韩国仁川',  'C', '哥斯达黎加','土耳其',1,1),
         (29,'2002/6/9 19:30', '日本横滨',  'H', '日本','俄罗斯',1,0),
         (30,'2002/6/10 14:30','韩国大邱',  'D', '韩国','美国',1,1),
         (31,'2002/6/10 17:30','日本大分',  'H', '突尼斯','比利时',1,1),
         (32,'2002/6/10 19:30','韩国全州',  'D', '葡萄牙','波兰',4,0),
         (33,'2002/6/11 14:30','韩国仁川',  'A', '丹麦','法国',2,0),
         (34,'2002/6/11 14:30','韩国水原',  'A', '塞内加尔','乌拉圭',3,3),
         (35,'2002/6/11 19:30','日本静冈',  'E', '喀麦隆','德国', 0, 2),
         (36,'2002/6/11 19:30','日本横滨',  'E', '沙特','爱尔兰', 0, 3),
         (37,'2002/6/12 14:30','日本仙台',  'F', '瑞典','阿根廷', 1, 1),
         (38,'2002/6/12 14:30','日本大阪',  'F', '尼日利亚','英格兰', 0, 0),
         (39,'2002/6/12 19:30','韩国大田',  'B', '南非','西班牙', 2, 3),
         (40,'2002/6/12 19:30','韩国西归埔','B', '斯洛文尼亚','巴拉圭', 1, 3),
         (41,'2002/6/13 14:30','韩国水原',  'C', '哥斯达黎加','巴西', 2, 5),
         (42,'2002/6/13 14:30','韩国汉城',  'C', '土耳其','中国', 3, 0),
         (43,'2002/6/13 19:30','日本大分',  'G', '墨西哥','意大利', 1, 1),
         (44,'2002/6/13 19:30','日本横滨',  'G', '厄瓜多尔','克罗地亚', 1, 0),
         (45,'2002/6/14 14:30','日本大阪',  'H', '突尼斯','日本', 0, 2),
         (46,'2002/6/14 14:30','日本静冈',  'H', '比利时','俄罗斯', 3, 2),
         (47,'2002/6/14 19:30','韩国仁川',  'D', '葡萄牙','韩国', 0, 1),
         (48,'2002/6/14 19:30','韩国大邱',  'D', '波兰','美国', 3, 1);

*/
DELETE FROM MatchRecord
/*
SELECT * FROM MatchRecord ORDER BY xgroup,number

/*
SELECT *
  FROM MatchRecord
 WHERE xgroup='A'
 ORDER BY number

UPDATE MatchRecord
 set number=0,
     goalsfor1=0,
     goalsfor2=0

*/