/*
SQLyog Enterprise - MySQL GUI v6.5 Beta1
MySQL - 5.1.39-community : Database - worldcup2002
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

create database if not exists `worldcup2002`;

USE `worldcup2002`;

/*Table structure for table `matchrecord` */

DROP TABLE IF EXISTS `matchrecord`;

CREATE TABLE `matchrecord` (
  `number` int(11) DEFAULT NULL,
  `fixture` datetime DEFAULT NULL,
  `place` char(20) DEFAULT NULL,
  `xgroup` char(1) NOT NULL,
  `teamname1` char(20) NOT NULL,
  `teamname2` char(20) NOT NULL,
  `goalsfor1` int(11) DEFAULT NULL,
  `goalsfor2` int(11) DEFAULT NULL,
  PRIMARY KEY (`teamname1`,`teamname2`),
  KEY `teamname2` (`teamname2`),
  CONSTRAINT `matchrecord_ibfk_1` FOREIGN KEY (`teamname1`) REFERENCES `teamscore` (`teamname`),
  CONSTRAINT `matchrecord_ibfk_2` FOREIGN KEY (`teamname2`) REFERENCES `teamscore` (`teamname`)
) ENGINE=InnoDB DEFAULT CHARSET=gbk;

/*Data for the table `matchrecord` */

insert  into `matchrecord`(`number`,`fixture`,`place`,`xgroup`,`teamname1`,`teamname2`,`goalsfor1`,`goalsfor2`) values (5,'2002-06-02 13:30:00','日本鹿岛','F','阿根廷','尼日利亚',1,0),(23,'2002-06-07 19:30:00','日本札幌','F','阿根廷','英格兰',0,1),(2,'2002-06-01 14:30:00','日本新泻','E','爱尔兰','喀麦隆',1,1),(6,'2002-06-02 15:30:00','韩国釜山','B','巴拉圭','南非',2,2),(10,'2002-06-03 17:00:00','韩国蔚山','C','巴西','土耳其',2,1),(26,'2002-06-08 19:30:00','韩国西归埔','C','巴西','中国',4,0),(46,'2002-06-14 14:30:00','日本静冈','H','比利时','俄罗斯',3,2),(48,'2002-06-14 19:30:00','韩国大邱','D','波兰','美国',3,1),(33,'2002-06-11 14:30:00','韩国仁川','A','丹麦','法国',2,0),(18,'2002-06-06 14:30:00','韩国大田','A','丹麦','塞内加尔',1,1),(17,'2002-06-05 19:30:00','日本鹿岛','E','德国','爱尔兰',1,1),(4,'2002-06-01 19:30:00','日本札幌','E','德国','沙特',8,0),(15,'2002-06-05 14:30:00','日本神户','H','俄罗斯','突尼斯',2,0),(44,'2002-06-13 19:30:00','日本横滨','G','厄瓜多尔','克罗地亚',1,0),(1,'2002-05-31 19:30:00','韩国汉城','A','法国','塞内加尔',0,1),(20,'2002-06-06 17:30:00','韩国釜山','A','法国','乌拉圭',0,0),(41,'2002-06-13 14:30:00','韩国水原','C','哥斯达黎加','巴西',2,5),(28,'2002-06-09 17:00:00','韩国仁川','C','哥斯达黎加','土耳其',1,1),(14,'2002-06-04 19:30:00','韩国釜山','D','韩国','波兰',2,0),(30,'2002-06-10 14:30:00','韩国大邱','D','韩国','美国',1,1),(35,'2002-06-11 19:30:00','日本静冈','E','喀麦隆','德国',0,2),(19,'2002-06-06 17:00:00','日本琦玉','E','喀麦隆','沙特',1,0),(9,'2002-06-03 14:30:00','日本新泻','G','克罗地亚','墨西哥',0,1),(16,'2002-06-05 17:00:00','韩国水原','D','美国','葡萄牙',3,2),(27,'2002-06-09 14:30:00','日本仙台','G','墨西哥','厄瓜多尔',2,1),(43,'2002-06-13 19:30:00','日本大分','G','墨西哥','意大利',1,1),(24,'2002-06-08 14:30:00','韩国大邱','B','南非','斯洛文尼亚',1,0),(39,'2002-06-12 19:30:00','韩国大田','B','南非','西班牙',2,3),(38,'2002-06-12 14:30:00','日本大阪','F','尼日利亚','英格兰',0,0),(32,'2002-06-10 19:30:00','韩国全州','D','葡萄牙','波兰',4,0),(47,'2002-06-14 19:30:00','韩国仁川','D','葡萄牙','韩国',0,1),(13,'2002-06-04 17:00:00','日本琦玉','H','日本','比利时',2,2),(29,'2002-06-09 19:30:00','日本横滨','H','日本','俄罗斯',1,0),(37,'2002-06-12 14:30:00','日本仙台','F','瑞典','阿根廷',1,1),(21,'2002-06-07 14:30:00','日本神户','F','瑞典','尼日利亚',2,1),(34,'2002-06-11 14:30:00','韩国水原','A','塞内加尔','乌拉圭',3,3),(36,'2002-06-11 19:30:00','日本横滨','E','沙特','爱尔兰',0,3),(40,'2002-06-12 19:30:00','韩国西归埔','B','斯洛文尼亚','巴拉圭',1,3),(31,'2002-06-10 17:30:00','日本大分','H','突尼斯','比利时',1,1),(45,'2002-06-14 14:30:00','日本大阪','H','突尼斯','日本',0,2),(42,'2002-06-13 14:30:00','韩国汉城','C','土耳其','中国',3,0),(3,'2002-06-01 17:00:00','韩国蔚山','A','乌拉圭','丹麦',1,2),(22,'2002-06-07 17:00:00','韩国全州','B','西班牙','巴拉圭',3,1),(8,'2002-06-02 19:30:00','韩国光州','B','西班牙','斯洛文尼亚',3,1),(11,'2002-06-03 19:30:00','日本札幌','G','意大利','厄瓜多尔',2,0),(25,'2002-06-08 17:00:00','日本鹿岛','G','意大利','克罗地亚',1,2),(7,'2002-06-02 17:30:00','日本琦玉','F','英格兰','瑞典',1,1),(12,'2002-06-04 14:30:00','韩国光州','C','中国','哥斯达黎加',0,2);

/*Table structure for table `teamscore` */

DROP TABLE IF EXISTS `teamscore`;

CREATE TABLE `teamscore` (
  `xgroup` char(1) NOT NULL,
  `teamname` char(20) NOT NULL,
  `completed` int(11) DEFAULT '0',
  `win` int(11) DEFAULT '0',
  `tie` int(11) DEFAULT '0',
  `loss` int(11) DEFAULT '0',
  `goalsfor` int(11) DEFAULT '0',
  `goalsagaint` int(11) DEFAULT '0',
  `netvalue` int(11) DEFAULT '0',
  `score` int(11) DEFAULT '0',
  `rank` int(11) DEFAULT '0',
  PRIMARY KEY (`teamname`)
) ENGINE=InnoDB DEFAULT CHARSET=gbk;

/*Data for the table `teamscore` */

insert  into `teamscore`(`xgroup`,`teamname`,`completed`,`win`,`tie`,`loss`,`goalsfor`,`goalsagaint`,`netvalue`,`score`,`rank`) values ('F','阿根廷',3,1,1,1,2,2,0,4,3),('E','爱尔兰',3,1,2,0,5,2,3,5,2),('B','巴拉圭',3,1,1,1,6,6,0,4,2),('C','巴西',3,3,0,0,11,3,8,9,1),('H','比利时',3,1,2,0,6,5,1,5,2),('D','波兰',3,1,0,2,3,7,-4,3,4),('A','丹麦',3,2,1,0,5,2,3,7,1),('E','德国',3,2,1,0,11,1,10,7,1),('H','俄罗斯',3,1,0,2,4,4,0,3,3),('G','厄瓜多尔',3,1,0,2,2,4,-2,3,4),('A','法国',3,0,1,2,0,3,-3,1,4),('C','哥斯达黎加',3,1,1,1,5,6,-1,4,3),('D','韩国',3,2,1,0,4,1,3,7,1),('E','喀麦隆',3,1,1,1,2,3,-1,4,3),('G','克罗地亚',3,1,0,2,2,3,-1,3,3),('D','美国',3,1,1,1,5,6,-1,4,2),('G','墨西哥',3,2,1,0,4,2,2,7,1),('B','南非',3,1,1,1,5,5,0,4,3),('F','尼日利亚',3,0,1,2,1,3,-2,1,4),('D','葡萄牙',3,1,0,2,6,4,2,3,3),('H','日本',3,2,1,0,5,2,3,7,1),('F','瑞典',3,1,2,0,4,3,1,5,1),('A','塞内加尔',3,1,2,0,5,4,1,5,2),('E','沙特',3,0,0,3,0,12,-12,0,4),('B','斯洛文尼亚',3,0,0,3,2,7,-5,0,4),('H','突尼斯',3,0,1,2,1,5,-4,1,4),('C','土耳其',3,1,1,1,5,3,2,4,2),('A','乌拉圭',3,0,2,1,4,5,-1,2,3),('B','西班牙',3,3,0,0,9,4,5,9,1),('G','意大利',3,1,1,1,4,3,1,4,2),('F','英格兰',3,1,2,0,2,1,1,5,2),('C','中国',3,0,0,3,0,9,-9,0,4);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
